system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;
patches
(
    {
        // Name of new patch
        name cylinder1_ami;
        // Type of new patch
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch cylinder2;
            transform rotational;
            rotationAxis (0 0 1);
            rotationCentre (0 0 0);
            matchTolerance 0.01;
        }
        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (cylinder1);
    }

    {
        // Name of new patch
        name cylinder2_ami;
        // Type of new patch
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch cylinder1;
            transform rotational;
            rotationAxis (0 0 1);
            rotationCentre (0 0 0);
            matchTolerance 0.01;
        }
        // How to construct: either from 'patches' or 'set'
        constructFrom patches;
        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (cylinder2);
    }
);